app/controllers/plants_controller.rb

  def show
    @plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @plant = Plant.new(plant_params)
    @plant.todo_id=params[:todo_id]
    if @plant.save
---
INSERT INTO "plants" ("water", "fertilize", "repot", "notes", "img", "created_at", "updated_at", "todo_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @plant.update(plant_params)
---
UPDATE "plants" SET "notes" = $1, "updated_at" = $2 WHERE "plants"."id" = $3  [["notes", "need to repot "], ["updated_at", "2021-10-27 20:07:50.827417"], ["id", 4]]

  def destroy
    @plant = Plant.destroy(params[:id])
---
DELETE FROM "plants" WHERE "plants"."id" = $1  [["id", 1]]